minhsmart2k1/BLE_EFR32_Mesh/ADV/app_i2c.c
  seq.addr  =  addr << 1;
  seq.flags = I2C_FLAG_WRITE_READ;
  /* Select command to issue */
  i2c_write_data[0] = reg;
  seq.buf[0].data   = i2c_write_data;
  seq.buf[0].len    = 1;
  /* Select location/length of data to be read */
  seq.buf[1].data = i2c_read_data;
  seq.buf[1].len  = 1;
  ret = I2C_TransferInit(I2C0, &seq);
  //ret = I2CSPM_Transfer(i2cspm, &seq);
  while (ret == i2cTransferInProgress)
    {
      ret = I2C_Transfer(I2C0);
    }
  if (ret != i2cTransferDone) {
    return 0; //fail
  }
  return i2c_read_data[0];
}

uint8_t readRegister8_buf(uint8_t addr, uint8_t reg, uint8_t *buf, uint16_t len)
{
  I2C_TransferSeq_TypeDef    seq;
    I2C_TransferReturn_TypeDef ret;
    uint8_t                    i2c_read_data[len];
    uint8_t                    i2c_write_data[1];

    seq.addr  = addr << 1;
    seq.flags = I2C_FLAG_WRITE_READ;
    /* Select command to issue */
    i2c_write_data[0] = reg;
    seq.buf[0].data   = i2c_write_data;
    seq.buf[0].len    = 1;
    /* Select location/length of data to be read */
    seq.buf[1].data = i2c_read_data;
    seq.buf[1].len  = len;

    ret = I2C_TransferInit(I2C0, &seq);

    while (ret == i2cTransferInProgress)
        {
          ret = I2C_Transfer(I2C0);
        }
      if (ret != i2cTransferDone) {
        return 0; //fail
      }
//      for(int j = 0; j < len; j++)
//        app_log_debug("\r read fifo %d: %d\n\r", j, i2c_read_data[j]);

  int i = 0;
  while (len != 0)
      {
              *buf = i2c_read_data[i];

          len--;
          buf++;
          i++;
      }
  return 1;

}

uint8_t readRegister8_point(uint8_t addr, uint8_t reg, uint8_t *buf, uint16_t len)
{
  I2C_TransferSeq_TypeDef    seq;
  I2C_TransferReturn_TypeDef ret;
  uint8_t                    i2c_read_data[1];
  uint8_t                    i2c_write_data[1];

  seq.addr  =  addr << 1;
  seq.flags = I2C_FLAG_WRITE_READ;
  /* Select command to issue */
  i2c_write_data[0] = reg;
  seq.buf[0].data   = i2c_write_data;
  seq.buf[0].len    = 1;
  /* Select location/length of data to be read */
  seq.buf[1].data = i2c_read_data;
  seq.buf[1].len  = 1;
  ret = I2C_TransferInit(I2C0, &seq);
  //ret = I2CSPM_Transfer(i2cspm, &seq);
  while (ret == i2cTransferInProgress)
    {
      ret = I2C_Transfer(I2C0);
    }
  if (ret != i2cTransferDone) {
    return 0; //fail
  }
  return i2c_read_data[0];
}

uint8_t writeRegister8(uint8_t addr, uint8_t reg)
{
  I2C_TransferSeq_TypeDef    seq;
  I2C_TransferReturn_TypeDef ret;
  uint8_t                    i2c_read_data[1];
  uint8_t                    i2c_write_data[2];

  seq.addr  =  addr << 1;
  seq.flags = I2C_FLAG_WRITE;
  /* Select command to issue */
  i2c_write_data[0] = reg;
  seq.buf[0].data   = i2c_write_data;
  seq.buf[0].len    = 1;
  /* Select location/length of data to be read */
  seq.buf[1].data = i2c_read_data;
  seq.buf[1].len  = 0;
  ret = I2C_TransferInit(I2C0, &seq);
  //ret = I2CSPM_Transfer(i2cspm, &seq);
  while (ret == i2cTransferInProgress)
    {
      ret = I2C_Transfer(I2C0);
    }
  if (ret != i2cTransferDone) {
    return 1; //fail
  }
  return 0;
}

size_t writeRegister8_value(uint8_t addr, uint8_t reg, uint8_t value)
{
  I2C_TransferSeq_TypeDef    seq;
  I2C_TransferReturn_TypeDef ret;
  uint8_t                    i2c_read_data[1];
  uint8_t                    i2c_write_data[2];

  seq.addr  =  addr << 1;
  seq.flags = I2C_FLAG_WRITE;
  /* Select command to issue */
  i2c_write_data[0] = reg;
  i2c_write_data[1] = value;
  seq.buf[0].data   = i2c_write_data;
  seq.buf[0].len    = 2;
  /* Select location/length of data to be read */
  seq.buf[1].data = i2c_read_data;
  seq.buf[1].len  = 0;
  ret = I2C_TransferInit(I2C0, &seq);
  //ret = I2CSPM_Transfer(i2cspm, &seq);
  while (ret == i2cTransferInProgress)
    {
      ret = I2C_Transfer(I2C0);
    }
  if (ret != i2cTransferDone) {
    return 1; //fail
  }
  return 0;
}

//Given a register, read it, mask it, and then set the thing
void bitMask(uint8_t reg, uint8_t mask, uint8_t thing)
{
  // Grab current register context
  uint8_t originalContents = readRegister8(I2C_ADDRESS, reg);

  // Zero-out the portions of the register we're interested in
  originalContents = originalContents & mask;

  // Change contents
  writeRegister8_value(I2C_ADDRESS, reg, originalContents | thing);
}

/**************************************************************************//**
 *   Enable DIE Temp interrupt
 *****************************************************************************/
void enableDIETEMPRDY(void) {
  bitMask(MAX30105_INTENABLE2, MAX30105_INT_DIE_TEMP_RDY_MASK, MAX30105_INT_DIE_TEMP_RDY_ENABLE);
}

// Die Temperature
// Returns temp in C
float readTemperature() {

  //DIE_TEMP_RDY interrupt must be enabled

  // Step 1: Config die temperature register to take 1 temperature sample
  writeRegister8_value(I2C_ADDRESS, MAX30105_DIETEMPCONFIG, 0x01);

  // Poll for bit to clear, reading is then complete
  // Timeout after 100m
    //uint8_t response = readRegister8(_i2caddr, MAX30105_DIETEMPCONFIG); //Original way
    //if ((response & 0x01) == 0) break; //We're done!
  while(true){
       sl_sleeptimer_delay_millisecond(100);

         //Check to see if DIE_TEMP_RDY interrupt is set
         uint8_t response = readRegister8(I2C_ADDRESS, MAX30105_INTSTAT2);
         if ((response & MAX30105_INT_DIE_TEMP_RDY_ENABLE) > 0) break; //We're done!
   }
    //if ((response & MAX30105_INT_DIE_TEMP_RDY_ENABLE) > 0) break; //We're done!
  //TODO How do we want to fail? With what type of error?
  //? if(millis() - startTime >= 100) return(-999.0);

  // Step 2: Read die temperature register (integer)
  int8_t tempInt = readRegister8(I2C_ADDRESS, MAX30105_DIETEMPINT);
  uint8_t tempFrac = readRegister8(I2C_ADDRESS, MAX30105_DIETEMPFRAC); //Causes the clearing of the DIE_TEMP_RDY interrupt

  // Step 3: Calculate temperature (datasheet pg. 23)
  return (float)(tempInt + (float)(tempFrac * 0.0625));
}

//End Interrupt configuration

void softReset(void) {
  bitMask(MAX30105_MODECONFIG, MAX30105_RESET_MASK, MAX30105_RESET);

  // Poll for bit to clear, reset is then complete
  // Timeout after 100ms
  while (true)
  {
      sl_sleeptimer_delay_millisecond(100);
    uint8_t response = readRegister8(I2C_ADDRESS, MAX30105_MODECONFIG);
    if ((response & MAX30105_RESET) == 0) break; //We're done!

