minhsmart2k1/BLE_EFR32_Mesh/ADV/app_i2c.c
  clearFIFO(); //Reset the FIFO before we begin checking the sensor
}

//Report the most recent IR value
uint32_t getIR(void)
{
  //Check the sensor for new data for 250ms
  if(safeCheck(250))
    return (sense.IR[sense.head]);
  else
    return(0); //Sensor failed to find new data
}

//Check for new data but give up after a certain amount of time
//Returns true if new data was found
//Returns false if new data was not found
bool safeCheck(uint8_t maxTimeToCheck)
{
  uint8_t cnt = 0;

  while(1)
  {

  if(cnt > maxTimeToCheck) return(false);

  if(check() == true) //We found new data!
    return(true);
  sl_sleeptimer_delay_millisecond(1);
  cnt++;
  }
}

//Read the FIFO Write Pointer
uint8_t getWritePointer(void) {
  return (readRegister8(I2C_ADDRESS, MAX30105_FIFOWRITEPTR));
}

//Read the FIFO Read Pointer
uint8_t getReadPointer(void) {
  return (readRegister8(I2C_ADDRESS, MAX30105_FIFOREADPTR));
}

//Polls the sensor for new data
//Call regularly
//If new data is available, it updates the head and tail in the main struct
//Returns number of new samples obtained
uint16_t check(void)
{
  //Read register FIDO_DATA in (3-byte * number of active LED) chunks
  //Until FIFO_RD_PTR = FIFO_WR_PTR

  uint8_t readPointer = getReadPointer();
  uint8_t writePointer = getWritePointer();

  int numberOfSamples = 0;

  //Do we have new data?
  if (readPointer != writePointer)
  {
    //Calculate the number of readings we need to get from sensor
    numberOfSamples = writePointer - readPointer;
    if (numberOfSamples < 0) numberOfSamples += 32; //Wrap condition

    //We now have the number of readings, now calc bytes to read
    //For this example we are just doing Red and IR (3 bytes each)
    int bytesLeftToRead = numberOfSamples * activeLEDs * 3;

    //Get ready to read a burst of data from the FIFO register
  //    _i2cPort->beginTransmission(MAX30105_ADDRESS);
  //    _i2cPort->write(MAX30105_FIFODATA);
  //    _i2cPort->endTransmission();


    //We may need to read as many as 288 bytes so we read in blocks no larger than I2C_BUFFER_LENGTH
    //I2C_BUFFER_LENGTH changes based on the platform. 64 bytes for SAMD21, 32 bytes for Uno.
    //Wire.requestFrom() is limited to BUFFER_LENGTH which is 32 on the Uno
    while (bytesLeftToRead > 0)
    {
      int toGet = bytesLeftToRead;
      if (toGet > I2C_BUFFER_LENGTH)
      {
        //If toGet is 32 this is bad because we read 6 bytes (Red+IR * 3 = 6) at a time
        //32 % 6 = 2 left over. We don't want to request 32 bytes, we want to request 30.
        //32 % 9 (Red+IR+GREEN) = 5 left over. We want to request 27.

        toGet = I2C_BUFFER_LENGTH - (I2C_BUFFER_LENGTH % (activeLEDs * 3)); //Trim toGet to be a multiple of the samples we need to read
      }
      app_log_debug("toGet: %d\n\r", toGet);
      bytesLeftToRead -= toGet;
      app_log_debug("bytesLeftToRead: %d\n\r", bytesLeftToRead);

      //Request toGet number of bytes from sensor
      //_i2cPort->requestFrom(MAX30105_ADDRESS, toGet);

      while (toGet > 0)
      {
        sense.head++; //Advance the head of the storage struct
        sense.head %= STORAGE_SIZE; //Wrap condition

        uint8_t temp[sizeof(uint32_t)]; //Array of 4 bytes that we will convert into long
        uint32_t tempLong;

        //Burst read three bytes - RED
        temp[3] = 0;
        temp[2] = readRegister8(I2C_ADDRESS, MAX30105_FIFODATA);
        temp[1] = readRegister8(I2C_ADDRESS, MAX30105_FIFODATA);
        temp[0] = readRegister8(I2C_ADDRESS, MAX30105_FIFODATA);

        //Convert array to long
        memcpy(&tempLong, temp, sizeof(tempLong));

    tempLong &= 0x3FFFF; //Zero out all but 18 bits

        sense.red[sense.head] = tempLong; //Store this reading into the sense array

        if (activeLEDs > 1)
        {
          //Burst read three more bytes - IR
          temp[3] = 0;
          temp[2] = readRegister8(I2C_ADDRESS, MAX30105_FIFODATA);;
          temp[1] = readRegister8(I2C_ADDRESS, MAX30105_FIFODATA);;
          temp[0] = readRegister8(I2C_ADDRESS, MAX30105_FIFODATA);;

          //Convert array to long
          memcpy(&tempLong, temp, sizeof(tempLong));

      tempLong &= 0x3FFFF; //Zero out all but 18 bits

      sense.IR[sense.head] = tempLong;
        }

        if (activeLEDs > 2)
        {
          //Burst read three more bytes - Green
          temp[3] = 0;
          temp[2] = readRegister8(I2C_ADDRESS, MAX30105_FIFODATA);;
          temp[1] = readRegister8(I2C_ADDRESS, MAX30105_FIFODATA);;
          temp[0] = readRegister8(I2C_ADDRESS, MAX30105_FIFODATA);;

          //Convert array to long
          memcpy(&tempLong, temp, sizeof(tempLong));

      tempLong &= 0x3FFFF; //Zero out all but 18 bits

          sense.green[sense.head] = tempLong;
        }

        toGet -= activeLEDs * 3;
      }

    } //End while (bytesLeftToRead > 0)

  } //End readPtr != writePtr

  return (numberOfSamples); //Let the world know how much new data we found
}


